[
    {
      "image_url": "https://www.themealdb.com/images/media/meals/bopa2i1683209167.jpg",
      "title": "Grilled eggplant with coconut milk",
      "description": ". Prepare the eggplants for grilling by pricking them all over with a fork. This is so it won’t burst during the grilling process as the natural water in it heats up. 2. Grill the eggplants, turning them over frequently to ensure even cooking. Grill until the skins are dark brown, even black and the eggplant is soft when you touch it. 3. Soak the grilled eggplant in a bowl of water to cool it down. Peel the skin off the eggplant. Place the whole eggplants in a shallow dish (my mom actually cuts the eggplant into small, bite-sized pieces). 4. In a small mixing bowl, mix together the coconut milk or cream, lemon powder, salt and hot pepper. Mix until the lemon powder and salt dissolve. Taste, then adjust the amount of lemon powder, salt and hot pepper to your liking. Pour the mixture over the eggplant. Sprinkle the green onions over the eggplant and coconut milk. Stir gently to combine.",
      "category": "Main Course"
    },
    {
      "image_url": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg",
      "title": "Apple & Blackberry Crumble",
      "description": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured. Meanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan. To serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.",
      "category": "Desserts"
    },
        {
      "image_url": "https://www.themealdb.com/images/media/meals/1549542994.jpg",
      "title": "Salmon Avocado Salad",
      "description": "Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing. Heat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm.",
      "category": "Salads"
    },
    {
      "image_url": "https://www.themealdb.com/images/media/meals/1529444830.jpg",
      "title": "Beef Lo Mein",
      "description": "STEP 1 - MARINATING THE BEEF In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together. STEP 2 - BOILING THE THE NOODLES In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water. STEP 3 - STIR FRY Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked. Set the cooked beef aside In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water. Add the noodles to wok To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce. Next add the beef to wok and stir-fry",
      "category": "Main Course"
    },
    {
      "image_url": "https://www.themealdb.com/images/media/meals/xxtsvx1511814083.jpg",
      "title": "Split Pea Soup",
      "description": "Put the gammon in a very large pan with 2 litres water and bring to the boil. Remove from the heat and drain off the water – this helps to get rid of some of the saltiness. Recover with 2 litres cold water and bring to the boil again. Put everything but the frozen peas into the pan and bring to the boil. Reduce to a simmer and cook for 1½-2½ hrs, topping up the water as and when you need to, to a similar level it started at. As the ham cooks and softens, you can halve it if you want, so it is all submerged under the liquid. When the ham is tender enough to pull into shreds, it is ready. Lift out the ham, peel off and discard the skin. While it is still hot (wear a clean pair of rubber gloves), shred the meat. Remove bay from the soup and stir in the frozen peas. Simmer for 1 min, then blend until smooth. Add a splash of water if too thick, and return to the pan to heat through if it has cooled, or if you are making ahead. When you are ready to serve, mix the hot soup with most of the ham – gently reheat if made ahead. Serve in bowls with the remaining ham scattered on top, and eat with crusty bread and butter.",
      "category": "Appetizers"
    }
]